{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 299, 299, 3], "sparse": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "bias_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "strides": [2, 2], "use_bias": false, "trainable": true}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}, "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "bias_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}, "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true}, "name": "max_pooling2d_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4", "bias_regularizer": null, "filters": 80, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}, "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_5", "bias_regularizer": null, "filters": 192, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}, "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true}, "name": "max_pooling2d_2", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_9", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_9", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_9", "trainable": true}, "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_7", "bias_regularizer": null, "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_10", "bias_regularizer": null, "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_7", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_10", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}, "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_10", "trainable": true}, "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"pool_size": [3, 3], "name": "average_pooling2d_1", "strides": [1, 1], "data_format": "channels_last", "padding": "same", "trainable": true}, "name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_6", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [5, 5], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_8", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_11", "bias_regularizer": null, "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_12", "bias_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_12", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_6", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_8", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_11", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_12", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}, "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true}, "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_11", "trainable": true}, "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_12", "trainable": true}, "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 3, "name": "mixed0", "trainable": true}, "name": "mixed0", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_16", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_16", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_16", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_16", "trainable": true}, "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_14", "bias_regularizer": null, "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_14", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_17", "bias_regularizer": null, "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_14", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_17", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_14", "trainable": true}, "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_17", "trainable": true}, "name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"pool_size": [3, 3], "name": "average_pooling2d_2", "strides": [1, 1], "data_format": "channels_last", "padding": "same", "trainable": true}, "name": "average_pooling2d_2", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_13", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_13", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [5, 5], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_15", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_18", "bias_regularizer": null, "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_19", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_13", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_15", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_18", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_19", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_13", "trainable": true}, "name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_15", "trainable": true}, "name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_18", "trainable": true}, "name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_19", "trainable": true}, "name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 3, "name": "mixed1", "trainable": true}, "name": "mixed1", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_23", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_23", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_23", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_23", "trainable": true}, "name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_21", "bias_regularizer": null, "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_21", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_24", "bias_regularizer": null, "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_21", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_24", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_21", "trainable": true}, "name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_24", "trainable": true}, "name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"pool_size": [3, 3], "name": "average_pooling2d_3", "strides": [1, 1], "data_format": "channels_last", "padding": "same", "trainable": true}, "name": "average_pooling2d_3", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_20", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_20", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [5, 5], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_22", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_25", "bias_regularizer": null, "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_26", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_26", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_20", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_22", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_25", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_26", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_20", "trainable": true}, "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_22", "trainable": true}, "name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_25", "trainable": true}, "name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_26", "trainable": true}, "name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 3, "name": "mixed2", "trainable": true}, "name": "mixed2", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_28", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_28", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_28", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_28", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_28", "trainable": true}, "name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_29", "bias_regularizer": null, "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_29", "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_29", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_29", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_29", "trainable": true}, "name": "activation_29", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_27", "bias_regularizer": null, "filters": 384, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "strides": [2, 2], "use_bias": false, "trainable": true}, "name": "conv2d_27", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_30", "bias_regularizer": null, "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "strides": [2, 2], "use_bias": false, "trainable": true}, "name": "conv2d_30", "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_27", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_30", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_30", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_27", "trainable": true}, "name": "activation_27", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_30", "trainable": true}, "name": "activation_30", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true}, "name": "max_pooling2d_3", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 3, "name": "mixed3", "trainable": true}, "name": "mixed3", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_35", "bias_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_35", "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_35", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_35", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_35", "trainable": true}, "name": "activation_35", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [7, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_36", "bias_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "trainable": true}, "name": "conv2d_36", "inbound_nodes": [[["activation_35", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "center": true, "name": "batch_normalization_36", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_36", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_36", "trainable": true}, "name": "activation_36", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], 